MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV64GM002/mcu.h
#define _CTMUCON2_EDG2STAT_POSITION              0x00000009
#define _CTMUCON2_EDG2STAT_MASK                  0x00000200
#define _CTMUCON2_EDG2STAT_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL_POSITION               0x0000000A
#define _CTMUCON2_EDG1SEL_MASK                   0x00003C00
#define _CTMUCON2_EDG1SEL_LENGTH                 0x00000004

#define _CTMUCON2_EDG1POL_POSITION               0x0000000E
#define _CTMUCON2_EDG1POL_MASK                   0x00004000
#define _CTMUCON2_EDG1POL_LENGTH                 0x00000001

#define _CTMUCON2_EDG1MOD_POSITION               0x0000000F
#define _CTMUCON2_EDG1MOD_MASK                   0x00008000
#define _CTMUCON2_EDG1MOD_LENGTH                 0x00000001

#define _CTMUCON2_EDG2SEL0_POSITION              0x00000002
#define _CTMUCON2_EDG2SEL0_MASK                  0x00000004
#define _CTMUCON2_EDG2SEL0_LENGTH                0x00000001

#define _CTMUCON2_EDG2SEL1_POSITION              0x00000003
#define _CTMUCON2_EDG2SEL1_MASK                  0x00000008
#define _CTMUCON2_EDG2SEL1_LENGTH                0x00000001

#define _CTMUCON2_EDG2SEL2_POSITION              0x00000004
#define _CTMUCON2_EDG2SEL2_MASK                  0x00000010
#define _CTMUCON2_EDG2SEL2_LENGTH                0x00000001

#define _CTMUCON2_EDG2SEL3_POSITION              0x00000005
#define _CTMUCON2_EDG2SEL3_MASK                  0x00000020
#define _CTMUCON2_EDG2SEL3_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL0_POSITION              0x0000000A
#define _CTMUCON2_EDG1SEL0_MASK                  0x00000400
#define _CTMUCON2_EDG1SEL0_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL1_POSITION              0x0000000B
#define _CTMUCON2_EDG1SEL1_MASK                  0x00000800
#define _CTMUCON2_EDG1SEL1_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL2_POSITION              0x0000000C
#define _CTMUCON2_EDG1SEL2_MASK                  0x00001000
#define _CTMUCON2_EDG1SEL2_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL3_POSITION              0x0000000D
#define _CTMUCON2_EDG1SEL3_MASK                  0x00002000
#define _CTMUCON2_EDG1SEL3_LENGTH                0x00000001

#define _CTMUICON_IRNG_POSITION                  0x00000008
#define _CTMUICON_IRNG_MASK                      0x00000300
#define _CTMUICON_IRNG_LENGTH                    0x00000002

#define _CTMUICON_ITRIM_POSITION                 0x0000000A
#define _CTMUICON_ITRIM_MASK                     0x0000FC00
#define _CTMUICON_ITRIM_LENGTH                   0x00000006

#define _CTMUICON_IRNG0_POSITION                 0x00000008
#define _CTMUICON_IRNG0_MASK                     0x00000100
#define _CTMUICON_IRNG0_LENGTH                   0x00000001

#define _CTMUICON_IRNG1_POSITION                 0x00000009
#define _CTMUICON_IRNG1_MASK                     0x00000200
#define _CTMUICON_IRNG1_LENGTH                   0x00000001

#define _CTMUICON_ITRIM0_POSITION                0x0000000A
#define _CTMUICON_ITRIM0_MASK                    0x00000400
#define _CTMUICON_ITRIM0_LENGTH                  0x00000001

#define _CTMUICON_ITRIM1_POSITION                0x0000000B
#define _CTMUICON_ITRIM1_MASK                    0x00000800
#define _CTMUICON_ITRIM1_LENGTH                  0x00000001

#define _CTMUICON_ITRIM2_POSITION                0x0000000C
#define _CTMUICON_ITRIM2_MASK                    0x00001000
#define _CTMUICON_ITRIM2_LENGTH                  0x00000001

#define _CTMUICON_ITRIM3_POSITION                0x0000000D
#define _CTMUICON_ITRIM3_MASK                    0x00002000
#define _CTMUICON_ITRIM3_LENGTH                  0x00000001

#define _CTMUICON_ITRIM4_POSITION                0x0000000E
#define _CTMUICON_ITRIM4_MASK                    0x00004000
#define _CTMUICON_ITRIM4_LENGTH                  0x00000001

#define _CTMUICON_ITRIM5_POSITION                0x0000000F
#define _CTMUICON_ITRIM5_MASK                    0x00008000
#define _CTMUICON_ITRIM5_LENGTH                  0x00000001

#define _SENT1CON1_NIBCNT_POSITION               0x00000000
#define _SENT1CON1_NIBCNT_MASK                   0x00000007
#define _SENT1CON1_NIBCNT_LENGTH                 0x00000003

#define _SENT1CON1_PS_POSITION                   0x00000004
#define _SENT1CON1_PS_MASK                       0x00000010
#define _SENT1CON1_PS_LENGTH                     0x00000001

#define _SENT1CON1_SPCEN_POSITION                0x00000006
#define _SENT1CON1_SPCEN_MASK                    0x00000040
#define _SENT1CON1_SPCEN_LENGTH                  0x00000001

#define _SENT1CON1_PPP_POSITION                  0x00000007
#define _SENT1CON1_PPP_MASK                      0x00000080
#define _SENT1CON1_PPP_LENGTH                    0x00000001

#define _SENT1CON1_CRCEN_POSITION                0x00000008
#define _SENT1CON1_CRCEN_MASK                    0x00000100
#define _SENT1CON1_CRCEN_LENGTH                  0x00000001

#define _SENT1CON1_TXPOL_POSITION                0x00000009
#define _SENT1CON1_TXPOL_MASK                    0x00000200
#define _SENT1CON1_TXPOL_LENGTH                  0x00000001

#define _SENT1CON1_TXM_POSITION                  0x0000000A
#define _SENT1CON1_TXM_MASK                      0x00000400
#define _SENT1CON1_TXM_LENGTH                    0x00000001

#define _SENT1CON1_RCVEN_POSITION                0x0000000B
#define _SENT1CON1_RCVEN_MASK                    0x00000800
#define _SENT1CON1_RCVEN_LENGTH                  0x00000001

#define _SENT1CON1_SNTSIDL_POSITION              0x0000000D
#define _SENT1CON1_SNTSIDL_MASK                  0x00002000
#define _SENT1CON1_SNTSIDL_LENGTH                0x00000001

#define _SENT1CON1_SNTEN_POSITION                0x0000000F
#define _SENT1CON1_SNTEN_MASK                    0x00008000
#define _SENT1CON1_SNTEN_LENGTH                  0x00000001

#define _SENT1STAT_SYNCTXEN_POSITION             0x00000000
#define _SENT1STAT_SYNCTXEN_MASK                 0x00000001
#define _SENT1STAT_SYNCTXEN_LENGTH               0x00000001

#define _SENT1STAT_RXIDLE_POSITION               0x00000001
#define _SENT1STAT_RXIDLE_MASK                   0x00000002
#define _SENT1STAT_RXIDLE_LENGTH                 0x00000001

#define _SENT1STAT_FRMERR_POSITION               0x00000002
#define _SENT1STAT_FRMERR_MASK                   0x00000004
#define _SENT1STAT_FRMERR_LENGTH                 0x00000001

